#ifndef __DISPLAY_H
#define __DISPLAY_H 	   



/*******************************************
* @function: 	在显示屏幕上显示主界面
* @input:			无
* @return:		返回三个按键代表的三个值
* @author:		田小花
* @time:			2020.10.2
*******************************************/
void MENU_init(void);
	

/*******************************************
* @function: 	在显示屏幕上显示主界面
* @input:			无
* @return:		返回三个按键代表的三个值
* @author:		田小花
* @time:			2020.10.2
*******************************************/
void MENU_main(void);


/*******************************************
* @function: 	在显示屏幕上显示主界面
* @input:			无
* @return:		返回三个按键代表的三个值
* @author:		田小花
* @time:			2020.10.2
*******************************************/
void MENU_APP(unsigned char switch_value);


/*******************************************
* @function: 	在显示屏幕上显示设置界面
* @input:			无
* @return:		无
* @author:		田小花
* @time:			2020.10.2
*******************************************/
void MENU_SETTING(void );
	

/*******************************************
* @function: 	在显示屏幕上显示手电筒界面
* @input:			无
* @return:		无
* @author:		田小花
* @time:			2020.10.2
*******************************************/
void MENU_light(void );


/*******************************************
* @function: 	在显示屏幕上显示闹钟
* @input:			无
* @return:		无
* @author:		田小花
* @time:			2020.10.2
*******************************************/
void MENU_clock(void );

/*******************************************
* @function: 	在显示屏幕上显示游戏
* @input:			无
* @return:		无
* @author:		田小花
* @time:			2020.10.2
*******************************************/
void MENU_Game(void );
	

/*******************************************
* @function: 	在显示屏幕上显示退出
* @input:			无
* @return:		无
* @author:		田小花
* @time:			2020.10.2
*******************************************/

extern char Total_cycle; //定义了全局的每次主循环都对循环增加的变量，用来创造一个延时

void MENU_quit(void );
	


#endif


